# Лекция по типам данных словарь и кортеж в языке Python
# Длительность лекции: 2 часа

# 1. Словарь (dictionary)
# 1.1. Описание
# Словарь - это неупорядоченный изменяемый тип данных, который содержит пары ключ-значение.
# Ключи - уникальные и неизменяемые элементы (str, int, tuple), которые могут использоваться для доступа к значениям.
# Значения могут быть любого типа данных (int, str, list..).

# Пример создания словаря
dict_data = {"key1": "value1", "key2": "value2", "key3": "value3"}

# 1.2. Основные операции 
# 1.2.1 Доступ к значениям и перебор словаря

# Доступ к значению по ключу
print(dict_data["key1"]) # value1

# Получаем список ключей и список значений
print(dict_data.keys()) # ['key1', 'key2', 'key3']
print(dict_data.values()) # ['value1', 'value2', 'value3']

# Перебор элементов словаря (каждый элемент - это пара ключ-значение)
for key, value in dict_data.items():
    print(key, value)

# 1.2.2 Добавление, изменение и удаление элементов
# Добавление нового элемента в словарь
dict_data["key4"] = "value4"
print(dict_data) # {'key1': 'value1', 'key2': 'value2', 'key3': 'value3', 'key4': 'value4'}

# Изменение значения по ключу
dict_data["key1"] = "new_value1"
print(dict_data) # {'key1': 'new_value1', 'key2': 'value2', 'key3': 'value3', 'key4': 'value4'}

# Удаление элемента из словаря по ключу
del dict_data["key2"]
print(dict_data) # {'key1': 'new_value1', 'key3': 'value3', 'key4': 'value4'}

# 2. Кортеж (tuple)
# 2.1. Описание
# Кортеж - это неизменяемый упорядоченный тип данных, который может содержать элементы разных типов данных. 

# Пример создания кортежа
tuple_data = (1, "apple", [1, 2, 3])

# 2.2. Основные операции 
# 2.2.1 Доступ к элементам и перебор кортежа

# Доступ к элементу по индексу
print(tuple_data[0]) # 1

# Перебор элементов кортежа
for item in tuple_data:
    print(item)

# 2.2.2 Срезы
# Срезы позволяют получить подмножество элементов кортежа
print(tuple_data[1:]) # ('apple', [1, 2, 3])

# 2.2.3 Конкатенация и повторение кортежей
# Конкатенация позволяет объединить два кортежа в один
tuple_data2 = (4, "banana")
tuple_data_concat = tuple_data + tuple_data2
print(tuple_data_concat) # (1, 'apple', [1, 2, 3], 4, 'banana')

# Повторение кортежа
tuple_data_repeat = tuple_data * 2
print(tuple_data_repeat) # (1, 'apple', [1, 2, 3], 1, 'apple', [1, 2, 3])

# 2.2.4 Преобразование в список и обратно
# Преобразование кортежа в список
list_data = list(tuple_data)
print(list_data) # [1, 'apple', [1, 2, 3]]

# Преобразование списка в кортеж
tuple_data_new = tuple(list_data)
print(tuple_data_new) # (1, 'apple', [1, 2, 3])

# объявление кортежей
tuple_data = (1, 'apple', [1, 2, 3])
tuple_data2 = (4, "banana")

# конкатенация кортежей
tuple_data_concat = tuple_data + tuple_data2
print(tuple_data_concat) # (1, 'apple', [1, 2, 3], 4, 'banana')

# повторение кортежа
tuple_data_repeat = tuple_data * 2
print(tuple_data_repeat) # (1, 'apple', [1, 2, 3], 1, 'apple', [1, 2, 3])

# преобразование кортежа в список
list_data = list(tuple_data)
print(list_data) # [1, 'apple', [1, 2, 3]]

# преобразование списка в кортеж
tuple_data_new = tuple(list_data)
print(tuple_data_new) # (1, 'apple', [1, 2, 3])


# Задания для словарей:
1. Создать словарь, содержащий информацию о студентах (ФИО, возраст, группа). Вывести на экран только ФИО студентов.
2. Написать программу, которая на вход принимает словарь (имя и результат теста для нескольких человек) и выводит на экран список имен тех, кто набрал более 90 баллов.
3. Написать функцию, которая принимает на вход два словаря и возвращает их объединение.

# Задания для кортежей:
1. Создать кортеж из списка чисел, отсортировать его по возрастанию и вывести на экран.
2. Написать программу, которая на вход принимает два кортежа с координатами точек на плоскости и вычисляет расстояние между этими точками.
3. Создать кортеж, содержащий информацию о телефонных номерах (номер, владелец, оператор). Написать программу, которая запрашивает у пользователя оператора и выводит на экран все номера, принадлежащие этому оператору.